# 1 # Программа выводит два приветствия на разных строках
# print("Hi!")
# print("Hello!")
#
# print("Hi!","Hello!", sep="\t\n")


# name = input("Введите ваше имя: ")
# print("Hello,", name)
##################################################
###      06:01:26       #####

# print(1,2,3,4, sep="---")

# print("\tПервая строка с табуляцией\nВторая строка на новой строке")


# print('Это файл "example.txt"')
# print("Это файл \"example.txt\"")
# print("""Это файл "example.txt""")
# print('Это файл "example.txt"', end="")

# x = int(input(n2))
# y = int(input(m2))
# res = (x+y)
# print (res)

######### დავალევა 15,16,2026 truu fols ####

Логические операции

Напишите программу, которая получит два логических значения от пользователя и выведет результат логических операций and, or, not для этих значений, а также сравнение на равенство и неравенство. Для операции not используйте первое число. Продумайте в каком виде получать ввод от пользователя для логического значения.

Пример вывода:

Enter first value: <value1>
Enter second value: <value1>
and: True
or: True
not: False
equal: False
not equal: True



Проверка условий

Напишите программу, которая принимает на вход логические значения двух переменных (свет включён и окно открыто) и проверяет:

Оба ли условия выполнены.

Хотя бы одно из условий выполнено.

Пример вывода:

Свет включён? True

Окно открыто? False

Оба условия выполнены? False

Хотя бы одно условие выполнено? True



 * Стоимость мобильного тарифа

Напишите программу для расчёта стоимости использования мобильного тарифа:

Базовая стоимость: 30 евро.

Каждый мегабайт интернета сверх 500 МБ стоит 0.2 евро.

Программа должна запросить у пользователя количество использованных мегабайтов и вывести сколько всего он заплатил (базовый и переплата).

Пример вывода:

Введите использованные мегабайты: 510

Общая стоимость: 32.0










