# Напишите программу, которая обрабатывает список float чисел,
# вычисляет сумму положительных чисел.
# Результат необходимо вывести в формате денежной суммы
# (до 2 символов после запятой), добавляя символ валюты "$" вначале
# и разделяя тысячи запятой.
#
# Данные:
#
# numbers = [1245.4435, -302.1403, 87459.99, -520.8265, 1450.001]
#
#
# Пример вывода:
#
# Сумма положительных чисел: $90,155.43

# numbers = [1245.4435, -302.1403, 87459.99, -520.8265, 1450.001]
# positive_sum = 0
# for num in numbers:
#     if num > 0:
#         positive_sum += num
# print(f"Сумма положительных чисел: ${positive_sum:,.2f}")
#~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

# numbers = (1, 2, 3, 4, 2, 5, 3, 6, 4, 2, 9)
#
# b = ()
#
# for num in numbers:
#     if numbers.count(num) > 1 and num not in b:
#         print(f"Индексы элемента {num}:", end=" ")
#         for i in range(len(numbers)):
#             if numbers[i] == num:
#                 print(i, end=" ")
#         print()
#         b += (num,)
#
#
