
# მომხმარებელმა შეიყვანოს რიცხვი.
# თუ რიცხვი დადებითია, დაბეჭდე "დადებითი",
# თუ უარყოფითია — "უარყოფითი",
# თუ ნულია — "ნული".
#
# 📌 მინიშნება:
# while True:
#     try:
#         user_input = input("შეიყვანე რიცხვი :").replace(',', '.')
# except ValueError
#         nun = float(user_input)
#
#         if nun.is_integer():
#             nun = int(nun)
#
#         if nun > 0:
#                 print("დადებითი :",nun)
#                 break
#         elif nun < 0:
#                 print("უარყოფითი :", nun)
#         else :
#             print("ნული:", nun),
#     except ValueError:
#         print("გთხოვ, შეიყვანე მხოლოდ რიცხვი!")
#{num:g} — რას აკეთებს

# g არის float formatting specifier
#
# f-string-ში {} შიგნით გამოიყენება ასეთი სინტაქსი
# მომხმარებელმა შეიყვანოს ასაკი.
# თუ ასაკი 18 ან მეტია → "შენ ხარ სრულწლოვანი"
# სხვა შემთხვევაში → "შენ ხარ არასრულწლოვანი"

# nun = int(input(" შეიყვანოს ასაკი: "))
# if nun >= 18:
#         print ("შენ ხარ სრულწლოვანი :" ,nun)
# elif nun <18:
#     print("შენ ხარ არასრულწლოვანი :", nun)
# else :
#        print( print ("შენ ხარ სრულწლოვანი :" ,nun))


# while True:
#     try:
#         # მომხმარებლის შეყვანა, , -> .
#         user_input = input("შეიყვანე ასაკი: ").replace(',', '.')
#         age = float(user_input)
#
#         # ასაკის ვალიდაცია
#         if age < 0 or age > 120:
#             print("არასწორი ასაკი, სცადე თავიდან")
#             continue  # დაბრუნება ციკლის თავში
#
#         # მთლად რიცხვად გადაყვანა, თუ შესაძლებელია
#         display_age = int(age) if age.is_integer() else age
#
#         # სრულწლოვანი თუ არა
#         if age >= 18:
#             status = "შენ ხარ სრულწლოვანი"
#         else:
#             status = "შენ ხარ არასრულწლოვანი"
#
#         # ლუწი/კენტი (float-ის შემთხვევაში მთელ ნაწილზე)
#         if int(age) % 2 == 0:
#             parity = "და ასაკი ლუწია"
#         else:
#             parity = "და ასაკი კენტია"
#
#         # დაბეჭდა სუფთად
#         print(f"{status} {parity} ({display_age})")
#         break  # გამოსვლა loop-დან
#
#     except ValueError:
#         print("არასწორი ასაკი, შეიყვანე მხოლოდ რიცხვი!")

#  meshveliani ////
#
# Сумма цифр числа
# Напишите программу, которая вычисляет сумму цифр введённого числа.
# Пример вывода:
# Введите число: 12345
# Сумма цифр: 15
#
# n = int(input("Введите число: "))
# s = 0
# while n != 0:
#     s = s + n % 10
#     n = n // 10
#
# print("Сумма цифр:", s)
# #
# Напишите программу, которая запрашивает у пользователя целое число
# и определяет, является ли оно палиндромом. Число является палиндромом,
# если оно читается одинаково слева направо и справа налево.
#
# Пример вывода:
#
# Введите число: 12321
# Число 12321 является палиндромом.
#
# Введите число: 1234
# Число 1234 не является палиндромом.
#
# 2
# Запрашиваем число у пользователя

# num = int(input("Введите число: "))
# original = num  # сохраняем исходное число
# reversed_num = 0  # здесь будем строить перевёрнутое число
#
# # Переворачиваем число
# while num > 0:
#     reversed_num = reversed_num * 10 + num % 10
#     num //= 10
#
# # Проверяем, является ли число палиндромом
# if original == reversed_num:
#     print("Число", original, "является палиндромом.")
# else:
#     print("Число", original, "не является палиндромом.")






#  3
# Напишите программу, которая генерирует случайное число от 1 до 100 включительно и дает пользователю 10 попыток,
# чтобы угадать это число. Программа должна подсказывать, больше или меньше загаданное число. После завершения игры
# программа оценивает, насколько хорошая интуиция у игрока.
#
# Пример вывода:
#
# Угадайте число от 1 до 100. У вас 10 попыток.
# Ваше предположение: 50
# Загаданное число меньше вашего
# Ваше предположение: 25
# Загаданное число больше вашего
# Ваше предположение: 30
# Поздравляем! Вы угадали число: 30.
#
# Вы угадали число за 3 попытки. Отличный результат!
#
# Угадайте число от 1 до 100. У вас 10 попыток.
# Ваше предположение: 2
# Поздравляем! Вы угадали число: 2 за 1 попыток. Отличный результат!
# Отличная интуиция! Вы угадали с первой попытки!
#
# ## 3
# import random
#
# num_1 = random.randint(1, 100)
# print("Угадайте число от 1 до 100. У вас 10 попыток.")
#
# num_2 = 0
#
# while num_2 < 10:
#     num_3 = int(input("Ваше предположение: "))
#     num_2 += 1
#
#     if num_3 == num_1:
#         print("Поздравляем! Вы угадали число:", num_1)
#         break
#     elif num_3 > num_1:
#         print("Загаданное число меньше вашего")
#     else:
#         print("Загаданное число больше вашего")
#
# else:
#     print("Попытки закончились. Загаданное число было:", num_1)
#
# print("Вы сделали", num_2, "попытки")


























