# import math
# a = int(input("chislo:"))
# nun = a - math.floor(a)
# if a % 2 == 0:
#     print(a)
# elif a % 2 != 0:
#     print(nun,"dg")
# else:
#     print(nun)
###################################################
# import math
#
# x = float(input("Введите число: "))
#
# nun = x - math.floor(x)
#
# if 0.25 <= nun < 0.75:
#         print("Дробная часть находится в диапазоне [0.25, 0.75)")
# else:
#         print("Дробная часть не находится в диапазоне [0.25, 0.75)")

# цену товара.
#
# Если цена больше 500 у.е., применяется скидка 10%, иначе — 5%.
# Напишите логическое выражение, которое выбирает нужную скидку.

# a = int(input("Введите цену товара: "))
#
# if a > 500:
#     discount = a * 10 / 100
# else:
#     discount = a * 5 / 100
#
# final_price = a - discount
#
# print("Скидка:", discount)
# print("Итоговая цена:", final_price)
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# ფასი: a
# თუ ფასი > 1000 → 15% ფასდაკლება
# თუ ფასი 500–1000 → 10%
# თუ ფასი < 500 → 5%
# გამოცანა:
# დაწერე ლოგიკური გამოსახულება / პირობა, რომელიც ადგენს ფასდაკლებას.

# a = int(input("ფასი ტავარის:"))
# if a > 1000:
#   procent = 15
# elif 500 < a <= 100:
#     procent = 10
# else:
#     procent = 5
#     diskount = a * procent / 100
#     final_price = a - diskount
#     print("სკიდკა:",diskount)
#     print("საერთო ფასი:",final_price )
##----------------------------------------------------
# 2️⃣ სტუდენტის შეფასება
# მოცემულია შეფასება score (0–100)
# ≥ 90 → A
# 80–89 → B
# 70–79 → C
# 60–69 → D
# < 60 → F
# გამოცანა:
# დაწერე პირობა, რომელიც განსაზღვრავს შეფასების ქულა.
# score = int(input("შეიყვანეთ თქვენი ქულა:"  ))
#
# if score >= 90:
#     grade = "A"
# elif score >= 80:
#     grade = "B"
# elif score >= 70:
#     grade = "C"
# elif score >= 60:
#     grade = "D"
# else:
#     grade = "F"
#
# print("თქვენი შეფასება არის:", grade)

################################
# a = int(input("შეიყვანე თქვენი წონა:"))
# scote = a
# if a >= 90:
#     print("შენ ხარ მსუქანა:",a)
# elif a >= 80:
#     print("შენ ხარ პუტკუნა:",a)
# elif a >= 70:
#     print("კიდევ პუტკუნა ხარ:",a)
# elif a >= 60:
#     print("კარგად ხარ:",a)
# else:
#     print("სუპერ წონის ხარ:",a)
#####################################





























































